## Ordinal Number Encoding
Eg:Rank of Students

In [45]:
import datetime

In [46]:
today_date = datetime.datetime.today()
today_date

datetime.datetime(2022, 10, 25, 13, 37, 48, 320879)

In [47]:
today_date-datetime.timedelta(1)

datetime.datetime(2022, 10, 24, 13, 37, 48, 320879)

In [48]:
#### List Comprehension
days = [today_date-datetime.timedelta(x) for x in range(0,15)]
days

[datetime.datetime(2022, 10, 25, 13, 37, 48, 320879),
 datetime.datetime(2022, 10, 24, 13, 37, 48, 320879),
 datetime.datetime(2022, 10, 23, 13, 37, 48, 320879),
 datetime.datetime(2022, 10, 22, 13, 37, 48, 320879),
 datetime.datetime(2022, 10, 21, 13, 37, 48, 320879),
 datetime.datetime(2022, 10, 20, 13, 37, 48, 320879),
 datetime.datetime(2022, 10, 19, 13, 37, 48, 320879),
 datetime.datetime(2022, 10, 18, 13, 37, 48, 320879),
 datetime.datetime(2022, 10, 17, 13, 37, 48, 320879),
 datetime.datetime(2022, 10, 16, 13, 37, 48, 320879),
 datetime.datetime(2022, 10, 15, 13, 37, 48, 320879),
 datetime.datetime(2022, 10, 14, 13, 37, 48, 320879),
 datetime.datetime(2022, 10, 13, 13, 37, 48, 320879),
 datetime.datetime(2022, 10, 12, 13, 37, 48, 320879),
 datetime.datetime(2022, 10, 11, 13, 37, 48, 320879)]

In [49]:
import pandas as pd
data = pd.DataFrame(days)
data.columns=['Days']
data.head()

                        Days
0 2022-10-25 13:37:48.320879
1 2022-10-24 13:37:48.320879
2 2022-10-23 13:37:48.320879
3 2022-10-22 13:37:48.320879
4 2022-10-21 13:37:48.320879

In [50]:
data['weekday']=data['Days'].dt.day_name()
data

                         Days    weekday
0  2022-10-25 13:37:48.320879    Tuesday
1  2022-10-24 13:37:48.320879     Monday
2  2022-10-23 13:37:48.320879     Sunday
3  2022-10-22 13:37:48.320879   Saturday
4  2022-10-21 13:37:48.320879     Friday
5  2022-10-20 13:37:48.320879   Thursday
6  2022-10-19 13:37:48.320879  Wednesday
7  2022-10-18 13:37:48.320879    Tuesday
8  2022-10-17 13:37:48.320879     Monday
9  2022-10-16 13:37:48.320879     Sunday
10 2022-10-15 13:37:48.320879   Saturday
11 2022-10-14 13:37:48.320879     Friday
12 2022-10-13 13:37:48.320879   Thursday
13 2022-10-12 13:37:48.320879  Wednesday
14 2022-10-11 13:37:48.320879    Tuesday

In [51]:
days = {1:'Monday', 2:'Tuesday', 3:'Wednesday', 4:'Thursday', 5:'Friday', 6:'Saturday', 7:'Sunday'}
days

{1: 'Monday',
 2: 'Tuesday',
 3: 'Wednesday',
 4: 'Thursday',
 5: 'Friday',
 6: 'Saturday',
 7: 'Sunday'}

In [52]:
### data['weekday_ordinal'] = data['weekday'].map(days)
data['weekday_ordinal'] = [2,1,7,6,5,4,3,2,1,7,6,5,4,3,2]
data

                         Days    weekday  weekday_ordinal
0  2022-10-25 13:37:48.320879    Tuesday                2
1  2022-10-24 13:37:48.320879     Monday                1
2  2022-10-23 13:37:48.320879     Sunday                7
3  2022-10-22 13:37:48.320879   Saturday                6
4  2022-10-21 13:37:48.320879     Friday                5
5  2022-10-20 13:37:48.320879   Thursday                4
6  2022-10-19 13:37:48.320879  Wednesday                3
7  2022-10-18 13:37:48.320879    Tuesday                2
8  2022-10-17 13:37:48.320879     Monday                1
9  2022-10-16 13:37:48.320879     Sunday                7
10 2022-10-15 13:37:48.320879   Saturday                6
11 2022-10-14 13:37:48.320879     Friday                5
12 2022-10-13 13:37:48.320879   Thursday                4
13 2022-10-12 13:37:48.320879  Wednesday                3
14 2022-10-11 13:37:48.320879    Tuesday                2

## count or Frequency Encoding

In [53]:
import pandas as pd
df = pd.read_csv('adult.csv',usecols=['workclass','education','marital-status','occupation','relationship','race','gender','native-country'])
df.head()

,workclass,education,marital-status,occupation,relationship,race,gender,native-country
0,Private,11th,Never-married,Machine-op-inspct,Own-child,Black,Male,United-States
1,Private,HS-grad,Married-civ-spouse,Farming-fishing,Husband,White,Male,United-States
2,Local-gov,Assoc-acdm,Married-civ-spouse,Protective-serv,Husband,White,Male,United-States
3,Private,Some-college,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,United-States
4,?,Some-college,Never-married,?,Own-child,White,Female,United-States

In [54]:
for feature in df.columns[:]:
    print(feature,":",len(df[feature].unique()),'labels')

workclass : 9 labels
education : 16 labels
marital-status : 7 labels
occupation : 15 labels
relationship : 6 labels
race : 5 labels
gender : 2 labels
native-country : 42 labels

In [55]:
df['native-country'].shape          #value_counts().to_dict()

(48842,)

In [56]:
country = df['native-country']

In [57]:
country = pd.get_dummies(country,drop_first = True)
country.head()

,Cambodia,Canada,China,Columbia,Cuba,Dominican-Republic,Ecuador,El-Salvador,England,France,...,Portugal,Puerto-Rico,Scotland,South,Taiwan,Thailand,Trinadad&Tobago,United-States,Vietnam,Yugoslavia
0,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
1,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
2,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
3,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
4,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0

In [58]:
df.head()

,workclass,education,marital-status,occupation,relationship,race,gender,native-country
0,Private,11th,Never-married,Machine-op-inspct,Own-child,Black,Male,United-States
1,Private,HS-grad,Married-civ-spouse,Farming-fishing,Husband,White,Male,United-States
2,Local-gov,Assoc-acdm,Married-civ-spouse,Protective-serv,Husband,White,Male,United-States
3,Private,Some-college,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,United-States
4,?,Some-college,Never-married,?,Own-child,White,Female,United-States

In [59]:
import numpy as np
df['sex'] = np.where(df['gender'].isnull(),1,0)
df.head()

,workclass,education,marital-status,occupation,relationship,race,gender,native-country,sex
0,Private,11th,Never-married,Machine-op-inspct,Own-child,Black,Male,United-States,0
1,Private,HS-grad,Married-civ-spouse,Farming-fishing,Husband,White,Male,United-States,0
2,Local-gov,Assoc-acdm,Married-civ-spouse,Protective-serv,Husband,White,Male,United-States,0
3,Private,Some-college,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,United-States,0
4,?,Some-college,Never-married,?,Own-child,White,Female,United-States,0

In [60]:
df.drop(['gender'],axis=1,inplace=True)
df.head()

,workclass,education,marital-status,occupation,relationship,race,native-country,sex
0,Private,11th,Never-married,Machine-op-inspct,Own-child,Black,United-States,0
1,Private,HS-grad,Married-civ-spouse,Farming-fishing,Husband,White,United-States,0
2,Local-gov,Assoc-acdm,Married-civ-spouse,Protective-serv,Husband,White,United-States,0
3,Private,Some-college,Married-civ-spouse,Machine-op-inspct,Husband,Black,United-States,0
4,?,Some-college,Never-married,?,Own-child,White,United-States,0

In [61]:
df = df.join(country)
df.head()

,workclass,education,marital-status,occupation,relationship,race,native-country,sex,Cambodia,Canada,...,Portugal,Puerto-Rico,Scotland,South,Taiwan,Thailand,Trinadad&Tobago,United-States,Vietnam,Yugoslavia
0,Private,11th,Never-married,Machine-op-inspct,Own-child,Black,United-States,0,0,0,...,0,0,0,0,0,0,0,1,0,0
1,Private,HS-grad,Married-civ-spouse,Farming-fishing,Husband,White,United-States,0,0,0,...,0,0,0,0,0,0,0,1,0,0
2,Local-gov,Assoc-acdm,Married-civ-spouse,Protective-serv,Husband,White,United-States,0,0,0,...,0,0,0,0,0,0,0,1,0,0
3,Private,Some-college,Married-civ-spouse,Machine-op-inspct,Husband,Black,United-States,0,0,0,...,0,0,0,0,0,0,0,1,0,0
4,?,Some-college,Never-married,?,Own-child,White,United-States,0,0,0,...,0,0,0,0,0,0,0,1,0,0

In [62]:
df.drop(['native-country'],axis=1,inplace=True)

In [63]:
df.head()

,workclass,education,marital-status,occupation,relationship,race,sex,Cambodia,Canada,China,...,Portugal,Puerto-Rico,Scotland,South,Taiwan,Thailand,Trinadad&Tobago,United-States,Vietnam,Yugoslavia
0,Private,11th,Never-married,Machine-op-inspct,Own-child,Black,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
1,Private,HS-grad,Married-civ-spouse,Farming-fishing,Husband,White,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
2,Local-gov,Assoc-acdm,Married-civ-spouse,Protective-serv,Husband,White,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
3,Private,Some-college,Married-civ-spouse,Machine-op-inspct,Husband,Black,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
4,?,Some-college,Never-married,?,Own-child,White,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0

In [64]:
df['relationship'].dropna()

0        Own-child
1          Husband
2          Husband
3          Husband
4        Own-child
           ...
48837         Wife
48838      Husband
48839    Unmarried
48840    Own-child
48841         Wife
Name: relationship, Length: 48842, dtype: object

In [65]:
relation = df['relationship']
relation = pd.get_dummies(relation,drop_first=True)
relation

       Not-in-family  Other-relative  Own-child  Unmarried  Wife
0                  0               0          1          0     0
1                  0               0          0          0     0
2                  0               0          0          0     0
3                  0               0          0          0     0
4                  0               0          1          0     0
...              ...             ...        ...        ...   ...
48837              0               0          0          0     1
48838              0               0          0          0     0
48839              0               0          0          1     0
48840              0               0          1          0     0
48841              0               0          0          0     1

[48842 rows x 5 columns]

In [66]:
df.drop(['relationship'],axis=1,inplace=True)
df = df.join(relation)
df.head()

,workclass,education,marital-status,occupation,race,sex,Cambodia,Canada,China,Columbia,...,Thailand,Trinadad&Tobago,United-States,Vietnam,Yugoslavia,Not-in-family,Other-relative,Own-child,Unmarried,Wife
0,Private,11th,Never-married,Machine-op-inspct,Black,0,0,0,0,0,...,0,0,1,0,0,0,0,1,0,0
1,Private,HS-grad,Married-civ-spouse,Farming-fishing,White,0,0,0,0,0,...,0,0,1,0,0,0,0,0,0,0
2,Local-gov,Assoc-acdm,Married-civ-spouse,Protective-serv,White,0,0,0,0,0,...,0,0,1,0,0,0,0,0,0,0
3,Private,Some-college,Married-civ-spouse,Machine-op-inspct,Black,0,0,0,0,0,...,0,0,1,0,0,0,0,0,0,0
4,?,Some-college,Never-married,?,White,0,0,0,0,0,...,0,0,1,0,0,0,0,1,0,0

In [67]:
df['race'].value_counts()

White                 41762
Black                  4685
Asian-Pac-Islander     1519
Amer-Indian-Eskimo      470
Other                   406
Name: race, dtype: int64

In [68]:
race = df['race']
race = pd.get_dummies(race,drop_first=True)
race.head()

   Asian-Pac-Islander  Black  Other  White
0                   0      1      0      0
1                   0      0      0      1
2                   0      0      0      1
3                   0      1      0      0
4                   0      0      0      1

In [69]:
df.drop(['race'],axis=1,inplace=True)
df.head()

,workclass,education,marital-status,occupation,sex,Cambodia,Canada,China,Columbia,Cuba,...,Thailand,Trinadad&Tobago,United-States,Vietnam,Yugoslavia,Not-in-family,Other-relative,Own-child,Unmarried,Wife
0,Private,11th,Never-married,Machine-op-inspct,0,0,0,0,0,0,...,0,0,1,0,0,0,0,1,0,0
1,Private,HS-grad,Married-civ-spouse,Farming-fishing,0,0,0,0,0,0,...,0,0,1,0,0,0,0,0,0,0
2,Local-gov,Assoc-acdm,Married-civ-spouse,Protective-serv,0,0,0,0,0,0,...,0,0,1,0,0,0,0,0,0,0
3,Private,Some-college,Married-civ-spouse,Machine-op-inspct,0,0,0,0,0,0,...,0,0,1,0,0,0,0,0,0,0
4,?,Some-college,Never-married,?,0,0,0,0,0,0,...,0,0,1,0,0,0,0,1,0,0

In [70]:
df = df.join(race)
df.head()

,workclass,education,marital-status,occupation,sex,Cambodia,Canada,China,Columbia,Cuba,...,Yugoslavia,Not-in-family,Other-relative,Own-child,Unmarried,Wife,Asian-Pac-Islander,Black,Other,White
0,Private,11th,Never-married,Machine-op-inspct,0,0,0,0,0,0,...,0,0,0,1,0,0,0,1,0,0
1,Private,HS-grad,Married-civ-spouse,Farming-fishing,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
2,Local-gov,Assoc-acdm,Married-civ-spouse,Protective-serv,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
3,Private,Some-college,Married-civ-spouse,Machine-op-inspct,0,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
4,?,Some-college,Never-married,?,0,0,0,0,0,0,...,0,0,0,1,0,0,0,0,0,1

In [71]:
def impute_nan(df, variable):
    df[variable+"newvar"]=np.where(df[variable].isnull(),"Missing",df[variable])
for features in ['occupation']:
    impute_nan(df,features)
df.head()

,workclass,education,marital-status,occupation,sex,Cambodia,Canada,China,Columbia,Cuba,...,Not-in-family,Other-relative,Own-child,Unmarried,Wife,Asian-Pac-Islander,Black,Other,White,occupationnewvar
0,Private,11th,Never-married,Machine-op-inspct,0,0,0,0,0,0,...,0,0,1,0,0,0,1,0,0,Machine-op-inspct
1,Private,HS-grad,Married-civ-spouse,Farming-fishing,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,1,Farming-fishing
2,Local-gov,Assoc-acdm,Married-civ-spouse,Protective-serv,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,1,Protective-serv
3,Private,Some-college,Married-civ-spouse,Machine-op-inspct,0,0,0,0,0,0,...,0,0,0,0,0,0,1,0,0,Machine-op-inspct
4,?,Some-college,Never-married,?,0,0,0,0,0,0,...,0,0,1,0,0,0,0,0,1,?

# Count/Frequency Encoding

In [72]:
# Now let's replace each label in occupation by its count

# first we make a dict that maps each labels to counts 
df_frequency = df.occupation.value_counts().to_dict()

In [73]:
df.occupation.head()

0    Machine-op-inspct
1      Farming-fishing
2      Protective-serv
3    Machine-op-inspct
4                    ?
Name: occupation, dtype: object

In [74]:
df.occupation = df.occupation.map(df_frequency)
df.head()

,workclass,education,marital-status,occupation,sex,Cambodia,Canada,China,Columbia,Cuba,...,Not-in-family,Other-relative,Own-child,Unmarried,Wife,Asian-Pac-Islander,Black,Other,White,occupationnewvar
0,Private,11th,Never-married,3022,0,0,0,0,0,0,...,0,0,1,0,0,0,1,0,0,Machine-op-inspct
1,Private,HS-grad,Married-civ-spouse,1490,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,1,Farming-fishing
2,Local-gov,Assoc-acdm,Married-civ-spouse,983,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,1,Protective-serv
3,Private,Some-college,Married-civ-spouse,3022,0,0,0,0,0,0,...,0,0,0,0,0,0,1,0,0,Machine-op-inspct
4,?,Some-college,Never-married,2809,0,0,0,0,0,0,...,0,0,1,0,0,0,0,0,1,?

In [75]:
df['marital-status'].value_counts()

Married-civ-spouse       22379
Never-married            16117
Divorced                  6633
Separated                 1530
Widowed                   1518
Married-spouse-absent      628
Married-AF-spouse           37
Name: marital-status, dtype: int64

In [76]:
status = df['marital-status']
status = pd.get_dummies(status,drop_first=True)
status.head()

,Married-AF-spouse,Married-civ-spouse,Married-spouse-absent,Never-married,Separated,Widowed
0,0,0,0,1,0,0
1,0,1,0,0,0,0
2,0,1,0,0,0,0
3,0,1,0,0,0,0
4,0,0,0,1,0,0

In [77]:
df.drop(['marital-status'],axis=1,inplace=True)
df = df.join(status)
df.head()

,workclass,education,occupation,sex,Cambodia,Canada,China,Columbia,Cuba,Dominican-Republic,...,Black,Other,White,occupationnewvar,Married-AF-spouse,Married-civ-spouse,Married-spouse-absent,Never-married,Separated,Widowed
0,Private,11th,3022,0,0,0,0,0,0,0,...,1,0,0,Machine-op-inspct,0,0,0,1,0,0
1,Private,HS-grad,1490,0,0,0,0,0,0,0,...,0,0,1,Farming-fishing,0,1,0,0,0,0
2,Local-gov,Assoc-acdm,983,0,0,0,0,0,0,0,...,0,0,1,Protective-serv,0,1,0,0,0,0
3,Private,Some-college,3022,0,0,0,0,0,0,0,...,1,0,0,Machine-op-inspct,0,1,0,0,0,0
4,?,Some-college,2809,0,0,0,0,0,0,0,...,0,0,1,?,0,0,0,1,0,0

In [78]:
frequency = df.education.value_counts().to_dict()

In [79]:
df.education = df.education.map(frequency)
df.head()

,workclass,education,occupation,sex,Cambodia,Canada,China,Columbia,Cuba,Dominican-Republic,...,Black,Other,White,occupationnewvar,Married-AF-spouse,Married-civ-spouse,Married-spouse-absent,Never-married,Separated,Widowed
0,Private,1812,3022,0,0,0,0,0,0,0,...,1,0,0,Machine-op-inspct,0,0,0,1,0,0
1,Private,15784,1490,0,0,0,0,0,0,0,...,0,0,1,Farming-fishing,0,1,0,0,0,0
2,Local-gov,1601,983,0,0,0,0,0,0,0,...,0,0,1,Protective-serv,0,1,0,0,0,0
3,Private,10878,3022,0,0,0,0,0,0,0,...,1,0,0,Machine-op-inspct,0,1,0,0,0,0
4,?,10878,2809,0,0,0,0,0,0,0,...,0,0,1,?,0,0,0,1,0,0

In [80]:
df['workclass'] = df['workclass'].str.replace('?','local_public')
df.head()

C:\Users\ASUS\AppData\Local\Temp\ipykernel_5972\4119469153.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df['workclass'] = df['workclass'].str.replace('?','local_public')

,workclass,education,occupation,sex,Cambodia,Canada,China,Columbia,Cuba,Dominican-Republic,...,Black,Other,White,occupationnewvar,Married-AF-spouse,Married-civ-spouse,Married-spouse-absent,Never-married,Separated,Widowed
0,Private,1812,3022,0,0,0,0,0,0,0,...,1,0,0,Machine-op-inspct,0,0,0,1,0,0
1,Private,15784,1490,0,0,0,0,0,0,0,...,0,0,1,Farming-fishing,0,1,0,0,0,0
2,Local-gov,1601,983,0,0,0,0,0,0,0,...,0,0,1,Protective-serv,0,1,0,0,0,0
3,Private,10878,3022,0,0,0,0,0,0,0,...,1,0,0,Machine-op-inspct,0,1,0,0,0,0
4,local_public,10878,2809,0,0,0,0,0,0,0,...,0,0,1,?,0,0,0,1,0,0

In [81]:
df.workclass.value_counts().to_dict()

{'Private': 33906,
 'Self-emp-not-inc': 3862,
 'Local-gov': 3136,
 'local_public': 2799,
 'State-gov': 1981,
 'Self-emp-inc': 1695,
 'Federal-gov': 1432,
 'Without-pay': 21,
 'Never-worked': 10}

In [82]:
class_map = {'Private': 8,
             'Self-emp-not-inc': 7,
             'Local-gov': 6,
             'local_public': 5,
             'State-gov': 4,
             'Self-emp-inc': 3,
             'Federal-gov': 2,
             'Without-pay': 1,
             'Never-worked': 0
}
df['workclass_ordinal'] = df.workclass.map(class_map)
df.head()

,workclass,education,occupation,sex,Cambodia,Canada,China,Columbia,Cuba,Dominican-Republic,...,Other,White,occupationnewvar,Married-AF-spouse,Married-civ-spouse,Married-spouse-absent,Never-married,Separated,Widowed,workclass_ordinal
0,Private,1812,3022,0,0,0,0,0,0,0,...,0,0,Machine-op-inspct,0,0,0,1,0,0,8
1,Private,15784,1490,0,0,0,0,0,0,0,...,0,1,Farming-fishing,0,1,0,0,0,0,8
2,Local-gov,1601,983,0,0,0,0,0,0,0,...,0,1,Protective-serv,0,1,0,0,0,0,6
3,Private,10878,3022,0,0,0,0,0,0,0,...,0,0,Machine-op-inspct,0,1,0,0,0,0,8
4,local_public,10878,2809,0,0,0,0,0,0,0,...,0,1,?,0,0,0,1,0,0,5

In [83]:
df.drop(['workclass'],axis=1,inplace=True)
df.head()

,education,occupation,sex,Cambodia,Canada,China,Columbia,Cuba,Dominican-Republic,Ecuador,...,Other,White,occupationnewvar,Married-AF-spouse,Married-civ-spouse,Married-spouse-absent,Never-married,Separated,Widowed,workclass_ordinal
0,1812,3022,0,0,0,0,0,0,0,0,...,0,0,Machine-op-inspct,0,0,0,1,0,0,8
1,15784,1490,0,0,0,0,0,0,0,0,...,0,1,Farming-fishing,0,1,0,0,0,0,8
2,1601,983,0,0,0,0,0,0,0,0,...,0,1,Protective-serv,0,1,0,0,0,0,6
3,10878,3022,0,0,0,0,0,0,0,0,...,0,0,Machine-op-inspct,0,1,0,0,0,0,8
4,10878,2809,0,0,0,0,0,0,0,0,...,0,1,?,0,0,0,1,0,0,5

# Give the count_values to the Same column NOt Ordinal Encoding

In [84]:
df.occupationnewvar.value_counts().to_dict()

{'Prof-specialty': 6172,
 'Craft-repair': 6112,
 'Exec-managerial': 6086,
 'Adm-clerical': 5611,
 'Sales': 5504,
 'Other-service': 4923,
 'Machine-op-inspct': 3022,
 '?': 2809,
 'Transport-moving': 2355,
 'Handlers-cleaners': 2072,
 'Farming-fishing': 1490,
 'Tech-support': 1446,
 'Protective-serv': 983,
 'Priv-house-serv': 242,
 'Armed-Forces': 15}

In [85]:
occupation_var=df.occupationnewvar.value_counts().to_dict()
occupation_var

{'Prof-specialty': 6172,
 'Craft-repair': 6112,
 'Exec-managerial': 6086,
 'Adm-clerical': 5611,
 'Sales': 5504,
 'Other-service': 4923,
 'Machine-op-inspct': 3022,
 '?': 2809,
 'Transport-moving': 2355,
 'Handlers-cleaners': 2072,
 'Farming-fishing': 1490,
 'Tech-support': 1446,
 'Protective-serv': 983,
 'Priv-house-serv': 242,
 'Armed-Forces': 15}

In [86]:
df.occupationnewvar = df.occupationnewvar.map(occupation_var)
df.head()

,education,occupation,sex,Cambodia,Canada,China,Columbia,Cuba,Dominican-Republic,Ecuador,...,Other,White,occupationnewvar,Married-AF-spouse,Married-civ-spouse,Married-spouse-absent,Never-married,Separated,Widowed,workclass_ordinal
0,1812,3022,0,0,0,0,0,0,0,0,...,0,0,3022,0,0,0,1,0,0,8
1,15784,1490,0,0,0,0,0,0,0,0,...,0,1,1490,0,1,0,0,0,0,8
2,1601,983,0,0,0,0,0,0,0,0,...,0,1,983,0,1,0,0,0,0,6
3,10878,3022,0,0,0,0,0,0,0,0,...,0,0,3022,0,1,0,0,0,0,8
4,10878,2809,0,0,0,0,0,0,0,0,...,0,1,2809,0,0,0,1,0,0,5